cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
        <!-- REGISTER "DDR7" -->
        <register>
          <name>DDR7</name>
          <description>Port input/output Direction Setting Register 7</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDR8" -->
        <register>
          <name>DDR8</name>
          <description>Port input/output Direction Setting Register 8</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR9" -->
        <register>
          <name>DDR9</name>
          <description>Port input/output Direction Setting Register 9</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDRA" -->
        <register>
          <name>DDRA</name>
          <description>Port input/output Direction Setting Register A</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDRB" -->
        <register>
          <name>DDRB</name>
          <description>Port input/output Direction Setting Register B</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDRC" -->
        <register>
          <name>DDRC</name>
          <description>Port input/output Direction Setting Register C</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDRD" -->
        <register>
          <name>DDRD</name>
          <description>Port input/output Direction Setting Register D</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDRE" -->
        <register>
          <name>DDRE</name>
          <description>Port input/output Direction Setting Register E</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDRE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRF" -->
        <register>
          <name>DDRF</name>
          <description>Port input/output Direction Setting Register F</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register>
          <name>PDIR0</name>
          <description>Port Input Data Register 0</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000802A</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PDIR0</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDIR0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDIR0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDIR0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register>
          <name>PDIR1</name>
          <description>Port Input Data Register 1</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000C3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PDIR1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PDIR1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDIR1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDIR1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDIR1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDIR1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDIR1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDIR1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register>
          <name>PDIR2</name>
          <description>Port Input Data Register 2</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000E</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDIR2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDIR2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDIR2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
