cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
        <!-- REGISTER "EPFR37" -->
        <register>
          <name>EPFR37</name>
          <description>Extended Pin Function Setting Register 37</description>
          <addressOffset>0x694</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDO5E" -->
            <field>
              <name>SDO5E</name>
              <description>MFSI2S I2SSDO5 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDI5S" -->
            <field>
              <name>SDI5S</name>
              <description>MFSI2S I2SDI5 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WS5B" -->
            <field>
              <name>WS5B</name>
              <description>I2SWS5 Input/Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description>I2SCK5 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK5E" -->
            <field>
              <name>MCK5E</name>
              <description>I2SMCLK5 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK5S" -->
            <field>
              <name>MCK5S</name>
              <description>I2SMCLK5 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDO4E" -->
            <field>
              <name>SDO4E</name>
              <description>MFSI2S I2SSDO4 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDI4S" -->
            <field>
              <name>SDI4S</name>
              <description>MFSI2S I2SDI4 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WS4B" -->
            <field>
              <name>WS4B</name>
              <description>I2SWS4 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK4B" -->
            <field>
              <name>SCK4B</name>
              <description>I2SCK4 Input/Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK4E" -->
            <field>
              <name>MCK4E</name>
              <description>I2SMCLK4 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK4S" -->
            <field>
              <name>MCK4S</name>
              <description>I2SMCLK4 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR38" -->
        <register>
          <name>EPFR38</name>
          <description>Extended Pin Function Setting Register 38</description>
          <addressOffset>0x698</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDO6E" -->
            <field>
              <name>SDO6E</name>
              <description>MFSI2S I2SDO6 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDI6S" -->
            <field>
              <name>SDI6S</name>
              <description>MFSI2S I2SDI6 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WS6B" -->
            <field>
              <name>WS6B</name>
              <description>I2SWS6 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK6B" -->
            <field>
              <name>SCK6B</name>
              <description>I2SCK6 Input/Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK6E" -->
            <field>
              <name>MCK6E</name>
              <description>I2SMCLK6 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK6S" -->
            <field>
              <name>MCK6S</name>
              <description>I2SMCLK6 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
