cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
        <!-- REGISTER "PZR7" -->
        <register>
          <name>PZR7</name>
          <description>Port Pseudo Open Drain Setting Register 7</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZR8" -->
        <register>
          <name>PZR8</name>
          <description>Port Pseudo Open Drain Setting Register 8</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PZR8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZR8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR9" -->
        <register>
          <name>PZR9</name>
          <description>Port Pseudo Open Drain Setting Register 9</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRA" -->
        <register>
          <name>PZRA</name>
          <description>Port Pseudo Open Drain Setting Register A</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRB" -->
        <register>
          <name>PZRB</name>
          <description>Port Pseudo Open Drain Setting Register B</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRC" -->
        <register>
          <name>PZRC</name>
          <description>Port Pseudo Open Drain Setting Register C</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRD" -->
        <register>
          <name>PZRD</name>
          <description>Port Pseudo Open Drain Setting Register D</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRE" -->
        <register>
          <name>PZRE</name>
          <description>Port Pseudo Open Drain Setting Register E</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PZRE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PZRE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZRF" -->
        <register>
          <name>PZRF</name>
          <description>Port Pseudo Open Drain Setting Register F</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "LVDIE" -->
        <register>
          <name>LVDIE</name>
          <description>LVDI Input Setting Register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description>LVDI Input select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER0" -->
        <register>
          <name>FPOER0</name>
          <description>Fast GPIO Output Enable Register 0</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000802A</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of FPOER0</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of FPOER0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of FPOER0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of FPOER0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
