cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2CSLAVE" -->
    <peripheral>
      <name>I2CSLAVE</name>
      <description>I2C Slave Wakeup</description>
      <version>A</version>
      <groupName>I2CSLAVE</groupName>
      <baseAddress>0x40037980</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "IBSSR" -->
        <register>
          <name>IBSSR</name>
          <description>I2C Bus Slave Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0100</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT" -->
            <field>
              <name>INT</name>
              <description>Status Interrupt Request flag</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>Reception Interrupt Request flag</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>Transmission Data Empty flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FBT" -->
            <field>
              <name>FBT</name>
              <description>First Byte flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RACK" -->
            <field>
              <name>RACK</name>
              <description>Acknowledge flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RSA" -->
            <field>
              <name>RSA</name>
              <description>Reserved Address Detection flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRX" -->
            <field>
              <name>TRX</name>
              <description>Data Direction flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACT" -->
            <field>
              <name>ACT</name>
              <description>Active flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RSC" -->
            <field>
              <name>RSC</name>
              <description>Re-Start Condition Detection flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SPC" -->
            <field>
              <name>SPC</name>
              <description>Stop Condition Detection flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BB" -->
            <field>
              <name>BB</name>
              <description>Bus Busy flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSCR" -->
        <register>
          <name>IBSCR</name>
          <description>I2C Bus Slave Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x03BFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NFCNT" -->
            <field>
              <name>NFCNT</name>
              <description>Noise Filter Control bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSVEN" -->
            <field>
              <name>RSVEN</name>
              <description>Reserved Address Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKE" -->
            <field>
              <name>ACKE</name>
              <description>Acknowledge Enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WSEL" -->
            <field>
              <name>WSEL</name>
              <description>Wait Select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNDE" -->
            <field>
              <name>CNDE</name>
              <description>Condition Detection Interrupt Request Enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTE" -->
            <field>
              <name>INTE</name>
              <description>Status Interrupt Request Enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Reception Interrupt Request Enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmission Interrupt Request Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
