cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
        <!-- REGISTER "I2S_RDR" -->
        <register>
          <name>I2S_RDR</name>
          <description>Received Data Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "I2S_TDR" -->
        <register>
          <name>I2S_TDR</name>
          <description>Transmit Data Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "I2S_FCR" -->
        <register>
          <name>I2S_FCR</name>
          <description>FIFO Control Register 0 and 1</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0400</resetValue>
          <resetMask>0x070F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description>Transmit FIFO data request bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description>Transmit FIFO interrupt enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description>FIFO select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_FBYTE1" -->
        <register>
          <name>I2S_FBYTE1</name>
          <description>FIFO Byte Register 1</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_FBYTE2" -->
        <register>
          <name>I2S_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral>
      <name>MFS6</name>
      <description>Multi-function Serial Interface 6</description>
      <version>A</version>
      <groupName>MFS</groupName>
      <baseAddress>0x40038600</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UART_SCR" -->
        <register>
          <name>UART_SCR</name>
          <description>Serial Control Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x9F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCL" -->
            <field>
              <name>UPCL</name>
              <description>Programmable Clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Received interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmit interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBIE" -->
            <field>
              <name>TBIE</name>
              <description>Transmit bus idle interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXE" -->
            <field>
              <name>RXE</name>
              <description>Received operation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXE" -->
            <field>
              <name>TXE</name>
              <description>Transmission operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UART_SMR" -->
        <register>
          <name>UART_SMR</name>
          <description>Serial Mode Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xED</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>Operation mode set bit</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBL" -->
            <field>
              <name>SBL</name>
              <description>Stop bit length select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDS" -->
            <field>
              <name>BDS</name>
              <description>Transfer direction select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOE" -->
            <field>
              <name>SOE</name>
              <description>Serial data output enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UART_SSR" -->
        <register>
          <name>UART_SSR</name>
          <description>Serial Status Register</description>
          <alternateGroup>UART</alternateGroup>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Received error flag clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Parity error flag bit (only functions in operation mode 0)</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRE" -->
            <field>
              <name>FRE</name>
              <description>Framing error flag bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ORE" -->
            <field>
              <name>ORE</name>
              <description>Overrun error flag bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>Received data full flag bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>Transmit data empty flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TBI" -->
            <field>
              <name>TBI</name>
              <description>Transmit bus idle flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
