cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xc.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "VIR" -->
    <peripheral>
      <name>VIR</name>
      <description>Vector Indicate Registers</description>
      <version>A</version>
      <groupName>VIR</groupName>
      <baseAddress>0xF8000100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "VIR00" -->
        <register>
          <name>VIR00</name>
          <description>Vector Indicate Register 00</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR01" -->
        <register>
          <name>VIR01</name>
          <description>Vector Indicate Register 01</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR02" -->
        <register>
          <name>VIR02</name>
          <description>Vector Indicate Register 02</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR03" -->
        <register>
          <name>VIR03</name>
          <description>Vector Indicate Register 03</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR04" -->
        <register>
          <name>VIR04</name>
          <description>Vector Indicate Register 04</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR05" -->
        <register>
          <name>VIR05</name>
          <description>Vector Indicate Register 05</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR06" -->
        <register>
          <name>VIR06</name>
          <description>Vector Indicate Register 06</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR07" -->
        <register>
          <name>VIR07</name>
          <description>Vector Indicate Register 07</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR08" -->
        <register>
          <name>VIR08</name>
          <description>Vector Indicate Register 08</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR09" -->
        <register>
          <name>VIR09</name>
          <description>Vector Indicate Register 09</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR10" -->
        <register>
          <name>VIR10</name>
          <description>Vector Indicate Register 10</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR11" -->
        <register>
          <name>VIR11</name>
          <description>Vector Indicate Register 11</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR12" -->
        <register>
          <name>VIR12</name>
          <description>Vector Indicate Register 12</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR13" -->
        <register>
          <name>VIR13</name>
          <description>Vector Indicate Register 13</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR14" -->
        <register>
          <name>VIR14</name>
          <description>Vector Indicate Register 14</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
